In [12]:
#load data set 
#data set 1
import csv
import pandas as pd

data = [
    ['StudentID','Name','Marks'],
    [101,'Alice',85],
    [102,'Bob',90],
    [103,'Charlie',88],
    [104,'David',92],
]

file_path = 'example.csv'

# Writing the data to CSV
with open(file_path, 'w', newline='') as csv_file:
    writer = csv.writer(csv_file)
    writer.writerows(data)

print(f"CSV file '{file_path}' created successfully.")
file_path

CSV file 'example.csv' created successfully.

'example.csv'

In [14]:
df=pd.read_csv(r"C:\Users\ASUS\example.csv")

In [15]:
df

   StudentID     Name  Marks
0        101    Alice     85
1        102      Bob     90
2        103  Charlie     88
3        104    David     92

In [18]:
#load data set 2
# data set 2
import csv
import pandas

dataa = [
    ['StudentID','Age','Grade'],
    [101,20,'A'],
    [102,21,'B'],
    [103,22,'A'],
    [105,19,'C']
]

file_path = 'details.csv'

# Writing the data to CSV
with open(file_path, 'w', newline='') as csv_file:
    writer = csv.writer(csv_file)
    writer.writerows(dataa)

print(f"CSV file '{file_path}' created successfully.")
file_path

CSV file 'details.csv' created successfully.

'details.csv'

In [19]:
ah=pd.read_csv(r'C:\Users\ASUS\Documents\details.csv')

In [22]:
ah

   StudentID  Age Grade
0        101   20     A
1        102   21     B
2        103   22     A
3        105   19     C

In [23]:
#Mergeing using right join
merged_df=pd.merge(ah,df,on='StudentID',how='right')


"""Right Join (how='right'): Includes all rows from the right dataframe (df) and the matching rows from the left dataframe (dc).
If there is no match, the result will contain NaN for columns from the left dataframe."""

"Right Join (how='right'): Includes all rows from the right dataframe (df) and the matching rows from the left dataframe (dc).\nIf there is no match, the result will contain NaN for columns from the left dataframe."

In [26]:
merged_df

   StudentID   Age Grade     Name  Marks
0        101  20.0     A    Alice     85
1        102  21.0     B      Bob     90
2        103  22.0     A  Charlie     88
3        104   NaN   NaN    David     92

In [27]:
#Mergeing using left join
merged_df=pd.merge(ah,df,on='StudentID',how='left')


"""Left Join (how='left'): Includes all rows from the left dataframe (dc) and the matching rows from the right dataframe (df). 
If there is no match, the result will contain NaN for columns from the right dataframe."""

"Left Join (how='left'): Includes all rows from the left dataframe (dc) and the matching rows from the right dataframe (df). \nIf there is no match, the result will contain NaN for columns from the right dataframe."

In [30]:
merged_df

   StudentID  Age Grade     Name  Marks
0        101   20     A    Alice   85.0
1        102   21     B      Bob   90.0
2        103   22     A  Charlie   88.0
3        105   19     C      NaN    NaN

In [31]:
#merging using inner join
merged_df=pd.merge(ah,df,on ='StudentID',how='inner')

"""Inner Join (how='inner'): Includes only the rows that have matching values in both dataframes (dc and df) based on the 'StudentID' column.
If there is no match, the row is excluded from the result.
1.Inner Join results in the intersection of the two dataframes.
"""

"Inner Join (how='inner'): Includes only the rows that have matching values in both dataframes (dc and df) based on the 'StudentID' column.\nIf there is no match, the row is excluded from the result.\n1.Inner Join results in the intersection of the two dataframes.\n"

In [34]:
merged_df

   StudentID  Age Grade     Name  Marks
0        101   20     A    Alice     85
1        102   21     B      Bob     90
2        103   22     A  Charlie     88

In [35]:
#merging using outer join
merged_df=pd.merge(ah,df,on='StudentID',how='outer')

"""Outer Join (how='outer'): Includes all rows from both dataframes (dc and df).
If there is no match, the result will contain NaN for the columns where there is no corresponding data in the other dataframe
2.Outer Join results in the union of the two dataframes.
"""

"Outer Join (how='outer'): Includes all rows from both dataframes (dc and df).\nIf there is no match, the result will contain NaN for the columns where there is no corresponding data in the other dataframe\n2.Outer Join results in the union of the two dataframes.\n"

In [38]:
merged_df

   StudentID   Age Grade     Name  Marks
0        101  20.0     A    Alice   85.0
1        102  21.0     B      Bob   90.0
2        103  22.0     A  Charlie   88.0
3        104   NaN   NaN    David   92.0
4        105  19.0     C      NaN    NaN

In [39]:
#student id set to index
merged_df.set_index('StudentID', inplace=True)
merged_df

            Age Grade     Name  Marks
StudentID
101        20.0     A    Alice   85.0
102        21.0     B      Bob   90.0
103        22.0     A  Charlie   88.0
104         NaN   NaN    David   92.0
105        19.0     C      NaN    NaN

In [42]:
#index reset as previous
merged_df.reset_index('StudentID', inplace=True)
merged_df

   StudentID   Age Grade     Name  Marks
0        101  20.0     A    Alice   85.0
1        102  21.0     B      Bob   90.0
2        103  22.0     A  Charlie   88.0
3        104   NaN   NaN    David   92.0
4        105  19.0     C      NaN    NaN

In [46]:
#Mergeing using left join
import pandas as pd
merged_df=pd.merge(ah,df,on='StudentID',how='right')
df

   StudentID     Name  Marks
0        101    Alice     85
1        102      Bob     90
2        103  Charlie     88
3        104    David     92

In [60]:
df=pd.read_csv("C:/Users/ASUS/OneDrive/Desktop/diabetes.csv")
df

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...,...
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [62]:
df.head()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1

In [64]:
df.tail()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 768 entries, 0 to 767
Data columns (total 9 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Pregnancies               768 non-null    int64
 1   Glucose                   768 non-null    int64
 2   BloodPressure             768 non-null    int64
 3   SkinThickness             768 non-null    int64
 4   Insulin                   768 non-null    int64
 5   BMI                       768 non-null    float64
 6   DiabetesPedigreeFunction  768 non-null    float64
 7   Age                       768 non-null    int64
 8   Outcome                   768 non-null    int64
dtypes: float64(2), int64(7)
memory usage: 54.1 KB

In [74]:
df["Glucose"] = df["Glucose"].replace(0, df["Glucose"].median())
df["BMI"] = df["BMI"].replace(0,df["BMI"].median())
df

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...,...
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0